<%@ page language="java" contentType="text/html; charset=UTF-8"
    pageEncoding="UTF-8"%>
<!DOCTYPE html>
<html>
<head>
<meta charset="UTF-8">
<title>Insert title here</title>
</head>
<body>
   스클립트언어:<%   %>
         -> 기본적인 자바 로직이옴 for,if,메서드 호출 등등... **브라우저에 출력은 할수없음. syso문을 쓸경우 콘솔창에 출력.
         -> 단 모든 스클립트언어에오는 부분은 다 지역변수처리임! 그러므로 메서드를 선언해줄수없음!
         -> 하나의 메서드 구문이라고 생각하면 쉬움!
   표현부:<%= %>
         -> 스클립트 언어에서 선언한 변수, 메서드(반환값있는) 등을 브라우저에 출력해줄때 사용
   선언부:<%! %>
         -> 메서드를 선언해주는 부분 선언만하고 호출은 스클립트언어 쪽에서해줘야함!
         ->전역변수 등을 생성해줄때도 사용 가능!
   지시부:<%@ %>임포트,페이지 등을 사용할때 사용 기본적으로 세팅 (지금은 깊게 몰라도 됨 나중에 page랑 다른거 사용할때는 알아야함!)
</body>
</html>